---
type: Definitions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# Definitions

`Autodesk.Revit.DB.Definitions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Definitions | — | `public Definitions ()` |
| Method | Contains | — | `public bool Contains ( Definition definition )` |
| Method | Create | 2015 | `public Definition Create ( ExternalDefinitionCreationOptions option )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < Definition > GetEnumerator ()` |
| Property | IsEmpty | — | `public bool IsEmpty { get ; }` |
| Property | Item | — | `public Definition this [ string name ] { get ; }` |
| Property | Size | — | `public int Size { get ; }` |